{
    "hello": {
        "title": "It is Muto Tsujimoto.",
        "message": "I am working on the systems and apps, which can solve the problems to make the users much more comfortable."
    },
    "cards": [
        {
            "thumbnail": "thumbnail/thumbnail_4.png",
            "title": "LINE Bot Service",
            "tags": [
                "LINE"
            ],
            "description": "We introduced LINE's Messaging API to make progress management easier than ever for those who work on the front line. \"Flex Message\" enables the user experience to be as easy as common web services. \n Just by asking \"When will you finish work today?\", the bot will automatically answer the question based on the current progress.",
            "infomations": [
                {
                    "title": "Developed on",
                    "data": "2020"
                },
                {
                    "title": "Languages",
                    "data": "Python"
                },
                {
                    "title": "Frameworks",
                    "data": "FastAPI"
                },
                {
                    "title": "Server",
                    "data": "Google App Engine"
                }
            ]
        },
        {
            "thumbnail": "thumbnail/thumbnail_2.png",
            "title": "Progress Management App",
            "tags": [
                "SPA",
                "WebSocket"
            ],
            "description": "By displaying the data acquired from sensors in the factory as a table or graph in the browser, anyone can easily grasp the progress and abnormality. By using WebSocket to receive the progress data, the latest data is always displayed.",
            "infomations": [
                {
                    "title": "Developed on",
                    "data": "2020"
                },
                {
                    "title": "Languages",
                    "data": "C#, SQL, Typescript, HTML, CSS"
                },
                {
                    "title": "Frameworks",
                    "data": "ASP.NET Core, Nuxt.js"
                },
                {
                    "title": "Server",
                    "data": "CentOS 8"
                }
            ]
        },
        {
            "thumbnail": "thumbnail/thumbnail_1.png",
            "title": "Operator Call App",
            "tags": [
                "Mobile",
                "GPS"
            ],
            "description": "When a product is ready to be taken out, the forklift operator is called up. The \"who\", \"when\" and \"where\" are recorded in the database so that the operator can immediately check the information, greatly reducing waste in transportation operations.",
            "infomations": [
                {
                    "title": "Developed on",
                    "data": "2020"
                },
                {
                    "title": "Languages",
                    "data": "C#, SQL, Dart"
                },
                {
                    "title": "Frameworks",
                    "data": "ASP.NET Core, Flutter"
                },
                {
                    "title": "Server",
                    "data": "CentOS 8"
                }
            ]
        },
        {
            "thumbnail": "thumbnail/thumbnail_3.png",
            "title": "Progress Data Collection System",
            "tags": [
                "Console",
                "TCP/IP"
            ],
            "description": "Communicates with a PLC (programmable logic controller) in the factory using a socket to read the value of the sensor connected to the PLC and write it to the database. Asynchronous processing makes it possible to acquire data in 100ms cycles.",
            "infomations": [
                {
                    "title": "Developed on",
                    "data": "2020"
                },
                {
                    "title": "Languages",
                    "data": "C#, SQL, Ladder logic"
                },
                {
                    "title": "Frameworks",
                    "data": ".NET Core"
                },
                {
                    "title": "Server",
                    "data": "CentOS 8"
                }
            ]
        },
        {
            "thumbnail": "thumbnail/thumbnail_5.png",
            "title": "Design Support System",
            "tags": [
                "Desktop"
            ],
            "description": "This system is designed to complete administrative processes related to design work, such as the management of drawings and property information, the output of forms, the recording of processing time, and the calculation of productivity. The system not only reduces the amount of time wasted each time, but also allows for more efficient management.",
            "infomations": [
                {
                    "title": "Developed on",
                    "data": "2019"
                },
                {
                    "title": "Languages",
                    "data": "C#, SQL"
                },
                {
                    "title": "Frameworks",
                    "data": ".NET Framework"
                },
                {
                    "title": "Server",
                    "data": "Microsoft Windows Server"
                }
            ]
        }
    ],
    "profile": {
        "name": "Muto Tsujimoto",
        "birthday": "June 10, 1999 -",
        "contents": [
            {
                "heading": "Nice to meet you",
                "texts": [
                    "I have been learning programming on my own since my parents gave me a computer when I was in the fourth grade. In my current position, I am the only system staff member in my department, and I develop and design systems by myself.",
                    "I am confident in my flexibility to respond to situations, and I have been able to work according to the situation at hand without being bound by fixed concepts. For example, when developing a system to be used at a manufacturing site, we often hear the \"voice of the craftsman\" and in some cases we are able to suggest methods that we have not thought of, while in other cases we are not able to answer the specific job description or specifications. While consulting with my supervisor and colleagues depending on the situation, I have been careful to delve into the matter myself and take the best course of action.",
                    "In terms of technology, we have always maintained an attitude of catching up by proactively incorporating new technologies. We have strived to improve productivity by selecting the language and technology to be used according to the requirements and development time, and deploying them as microservices.",
                    "I hope to be able to solve problems as an engineer who can quickly learn languages and technologies in any environment and make a deep commitment to the users.",
                    "Please take a look at our \"works\" page to see what we have created with the permission of the company."
                ]
            },
            {
                "heading": "Special skill",
                "texts": [
                    "I specialize in finding problems and developing full-stack systems and applications that lead to solutions. In my current position, I do everything from planning and conceptualization to requirements definition, design, development, and system release. The operation of the developed system varies, but I am also good at flexible operation, adopting cloud as well as on-premise depending on the requirements."
                ]
            }
        ],
        "whatICanDo": {
            "heading": "Skills",
            "rows": [
                {
                    "title": "Language",
                    "data": "C#, Python, Typescript, Javascript, Dart, SQL, HTML, CSS"
                },
                {
                    "title": "Back-end Fw",
                    "data": ".NET Core, ASP.NET Core, FastAPI, Flask"
                },
                {
                    "title": "Front-end Fw",
                    "data": "Vue.js, Nuxt.js, Flutter, Blazor"
                },
                {
                    "title": "Database",
                    "data": "MySQL, SQL Server"
                },
                {
                    "title": "OS",
                    "data": "CentOS, Apple macOS, Microsoft Windows Server"
                },
                {
                    "title": "Cloud Platform",
                    "data": "AWS, GCP"
                },
                {
                    "title": "Test",
                    "data": "Unit Test Design, Test-Driven Development"
                },
                {
                    "title": "Other",
                    "data": "Designing the REST API"
                },
                {
                    "title": "",
                    "data": "OAuth Authorization Server Development (I did it full scratch to understand how it works)"
                },
                {
                    "title": "",
                    "data": "TCP/IP for low-layer binary communication"
                }
            ]
        }
    },
    "contact": "If you have any questions, please feel free to contact us at the email address below."
}